layer {
  name: "data"
  type: "PatchData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  patch_sampler_param{
	   data_patch_shape{
		dim: 224
		dim: 224
		dim: 8
	   }
	   label_patch_shape{
		dim: 1
		dim: 1
		dim: 1
	   }
	   batch_size: 8
	   patches_per_data_batch: 899999
	   #data_source_batch_size: 1

 }

label_select_param{
	balance: true
	num_labels: 3
	num_top_label_balance: 2
	reorder_label: false
	class_prob_mapping_file: 'label_class_selection.prototxt'
}
  transform_nd_param{
    mirror: false
    padding: true
    pad_method: ZERO
  }
  data_provider_param{
    # Specify the data source.
    backend: HDF5
    batch_size: 1
    hdf5_file_shuffle: true
    data_source: "hdf5_train_file_list.txt"
  }

}


layer {
  name: "data"
  type: "PatchData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  patch_sampler_param{
	   data_patch_shape{
		dim: 224
		dim: 224
		dim: 8
	   }
	   label_patch_shape{
		dim: 1
		dim: 1
		dim: 1
	   }
	   batch_size: 1
	   patches_per_data_batch: 899999
	   #data_source_batch_size: 1
 }

 label_select_param{
			   balance: true
			   num_labels: 3
			   num_top_label_balance: 2
			   reorder_label: false
			   class_prob_mapping_file: 'label_class_selection_valid.prototxt'
		}
  transform_nd_param{
    mirror: false
    padding: true
    pad_method: ZERO
  }
  data_provider_param{
    # Specify the data source.
    backend: HDF5
    batch_size: 2
    hdf5_file_shuffle: true
    data_source: "hdf5_test_file_list.txt"
  }

}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    kernel_size: 7
	kernel_size: 7
	kernel_size: 3
    stride: 2
	stride: 2
	stride: 2
	pad:3
	pad:3
	pad:1

  weight_filler {
    type: "gaussian"
  std: 0.01
  }
  bias_filler {
    type: "constant"
    value: 0
  }
  }

}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_shape: 3 kernel_shape: 3 kernel_shape: 3
    stride_shape: 2 stride_shape: 2 stride_shape: 2
  }
}



#------------------------------------------- conv2x-------------------------------------
#---------------con2x_top-------------

layer {
  name: "conv2x_top"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2x_top"
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "gaussian"
    std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }

}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2x_top"
  top: "conv2x_top"
}


#------------------- conv3_x_-----------------------
layer {
  name: "conv3x_top"
  type: "Convolution"
  bottom: "conv2x_top"
  top: "conv3x_top"
  convolution_param {
    num_output: 512
    kernel_size: 3
	kernel_size: 3
	kernel_size: 2
	stride :2
	stride :2
	stride :1
	pad :1
	pad :1
	pad :0
    weight_filler {
      type: "gaussian"
	  std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3x_top"
  top: "conv3x_top"
}

#------------------- conv4_x_-----------------------

layer {
  name: "conv4x_top"
  type: "Convolution"
  bottom: "conv3x_top"
  top: "conv4x_top"
  convolution_param {
    num_output: 1024
    kernel_size: 3
	kernel_size: 3
	kernel_size: 1
	stride :2
	stride :2
	stride :1
	pad :1
	pad :1
	pad :0
  weight_filler {
    type: "gaussian"
  std: 0.01
  }
  bias_filler {
    type: "constant"
    value: 0
  }
  }

}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4x_top"
  top: "conv4x_top"
}

#------------------- conv5_x_-----------------------

layer {
  name: "conv5x_top"
  type: "Convolution"
  bottom: "conv4x_top"
  top: "conv5x_top"
  convolution_param {
    num_output: 256
    kernel_size: 3
	kernel_size: 3
	kernel_size: 1
	stride :2
	stride :2
	stride :1
	pad :1
	pad :1
	pad :0
  weight_filler {
    type: "gaussian"
  std: 0.01
  }
  bias_filler {
    type: "constant"
    value: 0
  }
  }

}

layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5x_top"
  top: "conv5x_top"
}


#------------------------------deconv-------------------
layer {
  name: "fc"
  type: "Convolution"
  bottom: "conv5x_top"
  top: "fc"
  convolution_param {
    num_output: 2
    kernel_size: 7
	kernel_size: 7
	kernel_size: 1
	stride :1
	stride :1
	stride :1
	pad :0
	pad :0
	pad :0
  weight_filler {
    type: "gaussian"
  std: 0.01
  }
  bias_filler {
    type: "constant"
    value: 0
  }
  }
}

layer{
  name: "drop4_1x"
  type: "Dropout"
  bottom: "fc"
  top: "fc"
  dropout_param {
    dropout_ratio: 0.5
  }
  }


layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc"
  bottom: "label"
  top: "loss"
  loss_param{
  ignore_label:3
  }
# label_select_param{
# 	balance: true
# 	num_labels: 3
# 	num_top_label_balance: 2
# 	reorder_label: false
# 	class_prob_mapping_file: 'label_weight.prototxt'
# 	}
}

layer{
     name: "accuracy"
     type: "Accuracy"
     bottom: "fc"
     bottom: "label"
	 top: "accuracy"
	 accuracy_param{
	 ignore_label:3
	 }
	 include {
    phase: TEST
   }
}
